In [1]:
#Add the Pandas dependency
import pandas as pd

In [2]:
#Files to load
grad_enroll=pd.read_csv('../../Grad_Enroll/grad_enroll_1415.csv')
grad_enroll

            CDS_CODE  ETHNIC  GR_12  ENR_TOTAL  GRADS  UC_GRADS
0      1100170000000       1      5         24      5         3
1      1100170000000       2     29        430     32         4
2      1100170000000       3      6         32      4         2
3      1100170000000       4      7         42      5         3
4      1100170000000       5    161        876    148        68
...              ...     ...    ...        ...    ...       ...
3376  58727700000000       4      4          7      4         1
3377  58727700000000       5     41        206     39        15
3378  58727700000000       6      1         22      1         0
3379  58727700000000       7     93        394     83        22
3380  58727700000000       9     12         69     13         4

[3381 rows x 6 columns]

In [3]:
finance_data=pd.read_csv("../../Finance Data/Finance_Data/Finance_1415.csv")
finance_data

,CDS_CODE,District_Code,Function_Code,Function,Amount
0,1100170000000,10017,2100,Classified Instructional Salaries ...,10755752.49
1,1100170000000,10017,5400,Insurance ...,3652.71
2,1100170000000,10017,5900,Communications ...,1329205.23
3,1100170000000,10017,7110,Tuition for Instruction Under Interdistrict At...,273962.33
4,1100170000000,10017,9200,Accounts Receivable ...,225391.00
...,...,...,...,...,...
4072,58727690000000,72769,2100,Classified Instructional Salaries ...,125817.35
4073,58727690000000,72769,4100,Approved Textbooks and Core Curricula Material...,651.48
4074,58727690000000,72769,4200,Books and Other Reference Materials ...,165657.79
4075,58727690000000,72769,8110,Maintenance and Operations (Public Law 81-874)...,210540.91
4076,58727690000000,72769,9200,Accounts Receivable ...,153239.08

In [4]:
grad_enroll_finance=pd.merge(grad_enroll, finance_data, on=['CDS_CODE'])
grad_enroll_finance

,CDS_CODE,ETHNIC,GR_12,ENR_TOTAL,GRADS,UC_GRADS,District_Code,Function_Code,Function,Amount
0,1100170000000,1,5,24,5,3,10017,2100,Classified Instructional Salaries ...,10755752.49
1,1100170000000,1,5,24,5,3,10017,5400,Insurance ...,3652.71
2,1100170000000,1,5,24,5,3,10017,5900,Communications ...,1329205.23
3,1100170000000,1,5,24,5,3,10017,7110,Tuition for Instruction Under Interdistrict At...,273962.33
4,1100170000000,1,5,24,5,3,10017,9200,Accounts Receivable ...,225391.00
...,...,...,...,...,...,...,...,...,...,...
3015,57727100000000,7,185,2390,171,85,72710,9200,Accounts Receivable ...,1103806.00
3016,57727100000000,9,5,137,5,2,72710,4100,Approved Textbooks and Core Curricula Material...,23840.80
3017,57727100000000,9,5,137,5,2,72710,4200,Books and Other Reference Materials ...,508602.40
3018,57727100000000,9,5,137,5,2,72710,7110,Tuition for Instruction Under Interdistrict At...,166647.19
3019,57727100000000,9,5,137,5,2,72710,9200,Accounts Receivable ...,1103806.00

In [5]:
grad_enroll_finance.to_csv('../All_Data_Data/All_1415')